Repository: svfnix/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/ChainOfResponsibilities/README.po
Languages: fa_ir

source: `Chain Of Responsibilities`__
fa_ir: الگوی Chain Of Responsibilities

source: Purpose
fa_ir: هدف

source: To build a chain of objects to handle a call in sequential order. If one object cannot handle a call, it delegates the call to the next in the chain and so forth.
fa_ir: ایجاد زنجیره ای از اشیاء با ترتیب متوالی جهت پاسخگویی به یک فراخوانی. اگر یک شی نتواند یک فراخوانی را مدیریت کند، درخواست را به شی بعدی در زنجیره واگذار می کند

source: Examples
fa_ir: مثال هایی از کاربرد ها

source: logging framework, where each chain element decides autonomously what to do with a log message
fa_ir: سرویس ثبت گزارشات، جایی که هر عنصر زنجیره به طور مستقل تصمیم می گیرد که با یک پیام گزارش چه کاری انجام دهد

source: a Spam filter
fa_ir: سرویس فیلتر هرزنامه

source: Caching: first object is an instance of e.g. a Memcached Interface, if that "misses" it delegates the call to the database interface
fa_ir: ذخیره سازی: فرض کنید اولین شی یک نمونه از رابط Memcached است،اگر قادر به بازیابی داده نباشد، درخواست را به رابط پایگاه داده منتقل می کند

source: UML Diagram
fa_ir: دیاگرام UML

source: Code
fa_ir: کد

source: You can also find this code on `GitHub`_
fa_ir: دسترسی به این کد در `GitHub`_ نیز امکان پذیر است

source: Test
fa_ir: آزمون
